"Add Date" = "Pridať dátum";
"Add Number Sequence" = "Pridať číslovanie";
"Apply to:" = "Použiť pre:";
"Batch Rename" = "Hromadné premenovanie";
"Case sensitive:" = "Závislosť na veľkosti písmen:";
"Change Case" = "Zmeniť veľkosť písmen";
"Change case to:" = "Zmeniť veľkosť písmen na:";
"Creation date" = "Dátum vytvorenia";
"Day of month:" = "Deň v mesiaci:";
"Day of week:" = "Deň v týždni:";
"Drag and drop files to this list to add, select and delete to remove, drag rows to rearrange." = "Pretiahnite súbory do tohoto zoznamu pre pridanie, označte a vymažte pre odstránenie a ťahaním usporiadajte.";
"Entire text" = "Celý text";
"Every occurrence" = "Každý výskyt";
"Extension" = "Prípona";
"Extension with dot" = "Prípona s bodkou";
"First occurrence" = "Prvý výskyt";
"Format:" = "Formát:";
"Hour:" = "Hodina:";
"Insert Text" = "Vložiť text";
"Last occurrence" = "Posledný výskyt";
"Loading files..." = "Načítanie súborov...";
"Minute:" = "Minúta:";
"Mode:" = "Mód:";
"Modification date" = "Dátum poslednej úpravy";
"Month:" = "Mesiac:";
"Name" = "Meno";
"Name with extension" = "Meno s príponou";
"No items will be renamed." = "Nebude premenovaná žiadna položka.";
"Padding:" = "Zarovnanie:";
"Position:" = "Pozícia:";
"Prefix:" = "Predvoľba:";
"Processing new names..." = "Spracovanie nových mien...";
"Renaming files..." = "Premenovanie súborov...";
"Replace RegEx" = "Nahradiť RegEx";
"Replace RegEx:" = "Nahradiť RegEx:";
"Replace Text" = "Nahradiť text";
"Replace text:" = "Nahradiť text:";
"Second:" = "Sekunda:";
"Some errors occurred during renaming and not all files were renamed." = "Počas premenovávania došlo k chybám a všetky súbory neboli premenované.";
"Start value:" = "Počiatočná hodnota:";
"Step value:" = "Hodnota kroku:";
"Suffix:" = "Prípona:";
"Type text and drag date elements to create a format" = "Pre vytvorenie formátu napište text a pretiahnite položky dátumu";
"Type:" = "Typ:";
"Year:" = "Rok:";
"items will be renamed." = "- počet položiek na premenovanie.";
"items would have conflicting names." = "u položiek by nastal konflikt mien.";
"with text:" = "obsahujúci text:";

/* ==== UNLOCALIZED ==== */

"Text:" = "Text:";
